Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>PWP319/j8I/p3Hq5bCIbESUXodk+suvwQpcvK01NNw2Zs+16PT8c8D/IYIc5w8+TH1EnVFmg1Ohd&#13;
qFaqWKHwSjL2oSLdXtMUI52wST8CFw7Sd5HVr/mlEREoWV/MOYnD1PTM65m2Vxt2QTu0GfzMN0QK&#13;
EjOjnT6zlUg1+BPlxXf/HjgMwZ10lIOH8um52PCPudH6nN1GH+Fj0zMsgSIC9fZSBYWlMLL5ln/j&#13;
onoKN33FzhrKs7hrHwN/GJg4xp0f9RLgnLZzNjbraOJXIJAB73HljCZSf5x9DXZek/KmlIKOKc6J&#13;
X5LoIuKUZbWaZDTwzjcqHMkOqvVrMnibwMMzHg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>aYy1+yizTR48pJubf4fqKQZu+HvVwU+1aZrUCPh+HYGF5MglRjTH/2F91QXg/oc5Xw8J69jsFoJU&#13;
Te/U3FVzJMb8dDu6s9KGMewRXJiL4Qk80jwS3lsrXRY+HSpJP8jFP4PB36tdSNr5JhCkeJs0iK3b&#13;
rMVzUnW59SgFlC2rGuyaWvVggsZh8FG+4Kc9kBIsdpvjEuAIh08Qq6pVtGDvFXVj7K7lUicGvC8Z&#13;
ZCyKBjUZEA5IuBhLI8CaXaGbMP6OyX/bOsHQb+oxEb0dxR4lEUoko+I3IdTpAgB2wpGdN3Vp4uHh&#13;
tXPvRxxSuN0+oanlsadELOH9gs8cCA11qgNydhMyHfEm2f5nZCwkt11UGXXRvb36/8l49/8sBzUT&#13;
2L1qgEj3BuhYnNoRVV9QHwa5nwImf44IyCayJoYl5z99a4ZJT1LTwJkWYGHoRMIElnEIOMs6IJ4t&#13;
Z+BIH4ye/zKHXeD8oIO/4glZYGDV+NCAKve+Pte8zs+iUb9+FrshdImak7DwlKC9mo7XHviH/kvu&#13;
u5Ir5JfkDnQSJQQ2V7ya27w6292b+Nu7P69RU0WRJ8zjhbPWAvfxeYGVOOEej1CMuLUkWVAzYwdQ&#13;
AiPwoxKvtZwnHHY25Ru1zUSwPisdzC4+spucxeDvd9SUpm1CiYY3Xt2i3ke7BKg3bjtSAno4pFtt&#13;
7NwVrJh4jKxgNUG/wikG+1FgNRVIYtIcAEHBhIskrvcO8lOZdPR9tTDhHPgH9FIibZh2Mjk9yC+E&#13;
Lfd6p/tjs4f6V8LIwEOohId8pDuqWu2IJtPYHgfWCrqdSq2n3riEMG6PSvN+uYWv21KbD86aLBcL&#13;
tlIGYZCEDX8zzyGY2nKpP8gZfFyVvxRbN7LtPl2+eDTBfs/F+R/g8v3sRFhJHipcjABCvuq11Vk1&#13;
D9Vu1qS502afiq6h/HiAP9q/8azZuc/vhAxDPs/aMWklaK3s</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>JNMvbg2vmPJgsIdN9M/forq3Uoo=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
AhP6abV6f9Tg5BSlp7InbHA7eYapJiflerijv2cr7gDhReqFocsbDjHZdFdrs7jBMklGXZ6PBjj5&#13;
AcJP/gSFY86hnkKrN9kt/D5Ke3avuggGqLFchvhUnd/p4c1zMPK7MUuS361lFlquMJhwq/3+i5v+&#13;
cQzbZoDnsyl1ju86CuoBc9/bP5+Jeu8o7/MF13iZp2KPofbN17YbXXqQ6yOkoLERdV/wqaLApkJs&#13;
i5dVzuU1WPEDzbBXetoAE5XQirYKIL6uXBWtYniMhHKCXUKN6+ocjzizH8jMgICZ2rt1JlFqTW2j&#13;
J5HW+e3r9qtbLQME8R67i5ECv869mjo1ND0PqQ==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>